Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.0.64/edc/PIC32MZ1025DAR169.PIC
      <edc:AdjustPoint edc:_addr="0x1F84B01C" edc:offset="0x4"/>
      <edc:SFRDef edc:_addr="0x1F84B020" edc:_begin="0x20" edc:_end="0x40" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1.Module" edc:_refcount="2" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ADCGIRQEN1" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="ADCGIRQEN1" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="ADCHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="AGIEN0" edc:mask="0x1" edc:name="AGIEN0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AGIEN1" edc:mask="0x1" edc:name="AGIEN1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AGIEN2" edc:mask="0x1" edc:name="AGIEN2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AGIEN3" edc:mask="0x1" edc:name="AGIEN3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AGIEN4" edc:mask="0x1" edc:name="AGIEN4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AGIEN5" edc:mask="0x1" edc:name="AGIEN5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AGIEN6" edc:mask="0x1" edc:name="AGIEN6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AGIEN7" edc:mask="0x1" edc:name="AGIEN7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AGIEN8" edc:mask="0x1" edc:name="AGIEN8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AGIEN9" edc:mask="0x1" edc:name="AGIEN9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AGIEN10" edc:mask="0x1" edc:name="AGIEN10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AGIEN11" edc:mask="0x1" edc:name="AGIEN11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AGIEN12" edc:mask="0x1" edc:name="AGIEN12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AGIEN13" edc:mask="0x1" edc:name="AGIEN13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AGIEN14" edc:mask="0x1" edc:name="AGIEN14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AGIEN15" edc:mask="0x1" edc:name="AGIEN15" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AGIEN16" edc:mask="0x1" edc:name="AGIEN16" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AGIEN17" edc:mask="0x1" edc:name="AGIEN17" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AGIEN18" edc:mask="0x1" edc:name="AGIEN18" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AGIEN19" edc:mask="0x1" edc:name="AGIEN19" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AGIEN20" edc:mask="0x1" edc:name="AGIEN20" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AGIEN21" edc:mask="0x1" edc:name="AGIEN21" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AGIEN22" edc:mask="0x1" edc:name="AGIEN22" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AGIEN23" edc:mask="0x1" edc:name="AGIEN23" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AGIEN24" edc:mask="0x1" edc:name="AGIEN24" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AGIEN25" edc:mask="0x1" edc:name="AGIEN25" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AGIEN26" edc:mask="0x1" edc:name="AGIEN26" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AGIEN27" edc:mask="0x1" edc:name="AGIEN27" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AGIEN28" edc:mask="0x1" edc:name="AGIEN28" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AGIEN29" edc:mask="0x1" edc:name="AGIEN29" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AGIEN30" edc:mask="0x1" edc:name="AGIEN30" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AGIEN31" edc:mask="0x1" edc:name="AGIEN31" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F84B024" edc:_begin="0x20" edc:_end="0x40" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1.Module" edc:_refcount="2" edc:access="--------------------nnnnnnnnnnnn" edc:cname="ADCGIRQEN2" edc:desc="" edc:impl="0xfff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------------000000000000" edc:name="ADCGIRQEN2" edc:nzwidth="32" edc:por="--------------------000000000000" ltx:memberofperipheral="ADCHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="AGIEN32" edc:mask="0x1" edc:name="AGIEN32" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AGIEN33" edc:mask="0x1" edc:name="AGIEN33" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AGIEN34" edc:mask="0x1" edc:name="AGIEN34" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AGIEN35" edc:mask="0x1" edc:name="AGIEN35" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AGIEN36" edc:mask="0x1" edc:name="AGIEN36" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AGIEN37" edc:mask="0x1" edc:name="AGIEN37" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AGIEN38" edc:mask="0x1" edc:name="AGIEN38" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AGIEN39" edc:mask="0x1" edc:name="AGIEN39" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AGIEN40" edc:mask="0x1" edc:name="AGIEN40" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AGIEN41" edc:mask="0x1" edc:name="AGIEN41" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AGIEN42" edc:mask="0x1" edc:name="AGIEN42" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AGIEN43" edc:mask="0x1" edc:name="AGIEN43" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
