Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.0.64/edc/PIC32MZ1025DAR169.PIC
      <edc:SFRDef edc:_addr="0x1F8E9128" edc:_begin="0x110" edc:_end="0x184" edc:_modsrc="DOS-EIP-00213_emb_ddr_phy_v1.Module" edc:_refcount="2" edc:access="------------------------nnnnnnnn" edc:cname="DDRPHYDLLCTRL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------------00000000" edc:name="DDRPHYDLLCTRL" edc:nzwidth="32" edc:por="------------------------00000000" ltx:memberofperipheral="DDR_PHY">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DDRDLLTRIM" edc:mask="0xff" edc:name="DDRDLLTRIM" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F8E912C" edc:_begin="0x110" edc:_end="0x184" edc:_modsrc="DOS-EIP-00213_emb_ddr_phy_v1.Module" edc:_refcount="2" edc:offset="0x14"/>
      <edc:SFRDef edc:_addr="0x1F8E9140" edc:_begin="0x110" edc:_end="0x184" edc:_modsrc="DOS-EIP-00213_emb_ddr_phy_v1.Module" edc:_refcount="2" edc:access="--------------------------rr-nnn" edc:cname="DDRPHYCLKDLY" edc:desc="" edc:impl="0x000000037" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------------------xx-000" edc:name="DDRPHYCLKDLY" edc:nzwidth="32" edc:por="--------------------------xx-000" ltx:memberofperipheral="DDR_PHY">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CLKDLYDELTA" edc:mask="0x7" edc:name="CLKDLYDELTA" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SCLLBPASS" edc:mask="0x1" edc:name="SCLLBPASS" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SCLUBPASS" edc:mask="0x1" edc:name="SCLUBPASS" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F8E9144" edc:_begin="0x110" edc:_end="0x184" edc:_modsrc="DOS-EIP-00213_emb_ddr_phy_v1.Module" edc:_refcount="2" edc:offset="0x18"/>
      <edc:SFRDef edc:_addr="0x1F8E915C" edc:_begin="0x110" edc:_end="0x184" edc:_modsrc="DOS-EIP-00213_emb_ddr_phy_v1.Module" edc:_refcount="2" edc:access="-------n------------------------" edc:cname="DDRADLLBYP" edc:desc="" edc:impl="0x1000000" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------0------------------------" edc:name="DDRADLLBYP" edc:nzwidth="32" edc:por="-------0------------------------" ltx:memberofperipheral="DDR_PHY">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="0x18"/>
            <edc:SFRFieldDef edc:cname="ANLDLLBYP" edc:mask="0x1" edc:name="ANLDLLBYP" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F8E9160" edc:_begin="0x110" edc:_end="0x184" edc:_modsrc="DOS-EIP-00213_emb_ddr_phy_v1.Module" edc:_refcount="2" edc:offset="0xc"/>
      <edc:SFRDef edc:_addr="0x1F8E916C" edc:_begin="0x110" edc:_end="0x184" edc:_modsrc="DOS-EIP-00213_emb_ddr_phy_v1.Module" edc:_refcount="2" edc:access="------------------------------nn" edc:cname="DDRSCLCFG2" edc:desc="" edc:impl="0x3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------------------00" edc:name="DDRSCLCFG2" edc:nzwidth="32" edc:por="------------------------------00" ltx:memberofperipheral="DDR_PHY">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SCLLANSEL" edc:mask="0x3" edc:name="SCLLANSEL" edc:nzwidth="0x2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F8E9170" edc:_begin="0x110" edc:_end="0x184" edc:_modsrc="DOS-EIP-00213_emb_ddr_phy_v1.Module" edc:_refcount="2" edc:offset="0x18"/>
      <edc:SFRDef edc:_addr="0x1F8E9188" edc:_begin="0x110" edc:_end="0x184" edc:_modsrc="DOS-EIP-00213_emb_ddr_phy_v1.Module" edc:_refcount="2" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="DDRPHYSCLADR" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="DDRPHYSCLADR" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="DDR_PHY">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SCLROWADR" edc:mask="0xffff" edc:name="SCLROWADR" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="SCLCOLADR" edc:mask="0x1fff" edc:name="SCLCOLADR" edc:nzwidth="0xd"/>
            <edc:SFRFieldDef edc:cname="SCLBANKADR" edc:mask="0x7" edc:name="SCLBANKADR" edc:nzwidth="0x3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F8E918C" edc:offset="0xe74"/>
      <edc:SFRDef edc:_addr="0x1F8EA000" edc:_begin="0x0" edc:_end="0x24" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="1" edc:access="nn-nnn-nnnnn----------nnnnn-----" edc:cname="GLCDMODE" edc:desc="" edc:impl="0xddf003e0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00-000-00000----------00000-----" edc:name="GLCDMODE" edc:nzwidth="32" edc:por="00-000-00000----------00000-----" ltx:baseofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="5"/>
            <edc:SFRFieldDef edc:cname="RGBSEQ" edc:desc="" edc:mask="0x7" edc:name="RGBSEQ" edc:nzwidth="3"/>
            <edc:SFRFieldDef edc:cname="FORMATCLK" edc:desc="" edc:mask="0x1" edc:name="FORMATCLK" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="YUVOUTPUT" edc:desc="" edc:mask="0x1" edc:name="YUVOUTPUT" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="9"/>
            <edc:SFRFieldDef edc:cname="FORCEBLANK" edc:desc="" edc:mask="0x1" edc:name="FORCEBLANK" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="PGRAMPEN" edc:desc="" edc:mask="0x1" edc:name="PGRAMPEN" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="PCLKPOL" edc:desc="" edc:mask="0x1" edc:name="PCLKPOL" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="VSYNCCYC" edc:desc="" edc:mask="0x1" edc:name="VSYNCCYC" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DITHER" edc:desc="" edc:mask="0x1" edc:name="DITHER" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="DEPOL" edc:desc="" edc:mask="0x1" edc:name="DEPOL" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="HSYNCPOL" edc:desc="" edc:mask="0x1" edc:name="HSYNCPOL" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="VSYNCPOL" edc:desc="" edc:mask="0x1" edc:name="VSYNCPOL" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CURSOREN" edc:desc="" edc:mask="0x1" edc:name="CURSOREN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="LCDEN" edc:desc="" edc:mask="0x1" edc:name="LCDEN" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
